// Условие задачи на русском
// Дано:

// Два целочисленных массива nums1 и nums2, отсортированных по неубыванию (то есть каждый следующий элемент ≥ предыдущего)

// Два целых числа m и n, где:

// m — количество реальных элементов в nums1

// n — количество элементов в nums2

// Особенность nums1:

// Длина массива nums1 = m + n

// Первые m элементов — это данные, которые нужно сливать

// Последние n элементов — это просто заглушки (нули).
// Они нужны, чтобы было место для элементов из nums2

// Задача:
// Слить nums1 и nums2 в один отсортированный массив и
// сохранить результат прямо в nums1 (не создавая новый массив).

// Пример 1:

// text
// Вход:  nums1 = [1,2,3,0,0,0], m = 3, nums2 = [2,5,6], n = 3
// Выход: [1,2,2,3,5,6]
// Пример 2:

// text
// Вход:  nums1 = [1], m = 1, nums2 = [], n = 0
// Выход: [1]
// Пример 3:

// text
// Вход:  nums1 = [0], m = 0, nums2 = [1], n = 1
// Выход: [1]
// (здесь m = 0, значит в nums1 нет реальных элементов, а 0 — просто заглушка)

// Ограничения:
// nums1.length == m + n

// nums2.length == n

// 0 <= m, n <= 200

// 1 <= m + n <= 200

// Значения элементов от -10⁹ до 10⁹
// Вход:  nums1 = [1,2,3,0,0,0], m = 3, nums2 = [2,5,6], n = 3

function merge(nums1, m, nums2, n) {
  let i = m - 1;
  let j = n - 1;
  let k = m + n - 1;
  
  while (j >= 0) {
    if (i >= 0 && nums1[i] > nums2[j]) {
      nums1[k] = nums1[i];
      i--;
    } else {
      nums1[k] = nums2[j];
      j--;
    }
    k--;
  }

}
